Tekla Open API Reference for Tekla Structures 2025
ErrorDialog.Show Method (Exception, ErrorDialog.Severity)
 Shows a new error dialog.
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static void Show(
	Exception Ex,
	ErrorDialog.Severity Severity
)
Public Shared Sub Show (
	Ex As Exception,
	Severity As ErrorDialog.Severity
)
Parameters
Ex
Type: System.Exception
The exception to display in the dialog.
Severity
Type: Tekla.Structures.Dialog.ErrorDialog.Severity
The severity of the exception.
Exceptions
Exception | Condition
ArgumentNullException | Thrown when the Ex parameter is null.
See Also
Reference
ErrorDialog Class
Show Overload
Tekla.Structures.Dialog Namespace